{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.20.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 400, 600, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_12_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "batch_input_shape": [null, 400, 600, 1], "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 528, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 342, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of106.bin", "group1-shard2of106.bin", "group1-shard3of106.bin", "group1-shard4of106.bin", "group1-shard5of106.bin", "group1-shard6of106.bin", "group1-shard7of106.bin", "group1-shard8of106.bin", "group1-shard9of106.bin", "group1-shard10of106.bin", "group1-shard11of106.bin", "group1-shard12of106.bin", "group1-shard13of106.bin", "group1-shard14of106.bin", "group1-shard15of106.bin", "group1-shard16of106.bin", "group1-shard17of106.bin", "group1-shard18of106.bin", "group1-shard19of106.bin", "group1-shard20of106.bin", "group1-shard21of106.bin", "group1-shard22of106.bin", "group1-shard23of106.bin", "group1-shard24of106.bin", "group1-shard25of106.bin", "group1-shard26of106.bin", "group1-shard27of106.bin", "group1-shard28of106.bin", "group1-shard29of106.bin", "group1-shard30of106.bin", "group1-shard31of106.bin", "group1-shard32of106.bin", "group1-shard33of106.bin", "group1-shard34of106.bin", "group1-shard35of106.bin", "group1-shard36of106.bin", "group1-shard37of106.bin", "group1-shard38of106.bin", "group1-shard39of106.bin", "group1-shard40of106.bin", "group1-shard41of106.bin", "group1-shard42of106.bin", "group1-shard43of106.bin", "group1-shard44of106.bin", "group1-shard45of106.bin", "group1-shard46of106.bin", "group1-shard47of106.bin", "group1-shard48of106.bin", "group1-shard49of106.bin", "group1-shard50of106.bin", "group1-shard51of106.bin", "group1-shard52of106.bin", "group1-shard53of106.bin", "group1-shard54of106.bin", "group1-shard55of106.bin", "group1-shard56of106.bin", "group1-shard57of106.bin", "group1-shard58of106.bin", "group1-shard59of106.bin", "group1-shard60of106.bin", "group1-shard61of106.bin", "group1-shard62of106.bin", "group1-shard63of106.bin", "group1-shard64of106.bin", "group1-shard65of106.bin", "group1-shard66of106.bin", "group1-shard67of106.bin", "group1-shard68of106.bin", "group1-shard69of106.bin", "group1-shard70of106.bin", "group1-shard71of106.bin", "group1-shard72of106.bin", "group1-shard73of106.bin", "group1-shard74of106.bin", "group1-shard75of106.bin", "group1-shard76of106.bin", "group1-shard77of106.bin", "group1-shard78of106.bin", "group1-shard79of106.bin", "group1-shard80of106.bin", "group1-shard81of106.bin", "group1-shard82of106.bin", "group1-shard83of106.bin", "group1-shard84of106.bin", "group1-shard85of106.bin", "group1-shard86of106.bin", "group1-shard87of106.bin", "group1-shard88of106.bin", "group1-shard89of106.bin", "group1-shard90of106.bin", "group1-shard91of106.bin", "group1-shard92of106.bin", "group1-shard93of106.bin", "group1-shard94of106.bin", "group1-shard95of106.bin", "group1-shard96of106.bin", "group1-shard97of106.bin", "group1-shard98of106.bin", "group1-shard99of106.bin", "group1-shard100of106.bin", "group1-shard101of106.bin", "group1-shard102of106.bin", "group1-shard103of106.bin", "group1-shard104of106.bin", "group1-shard105of106.bin", "group1-shard106of106.bin"], "weights": [{"name": "conv2d_12/kernel", "shape": [5, 5, 1, 16], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [5, 5, 32, 64], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [209024, 528], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [528], "dtype": "float32"}, {"name": "dense_17/kernel", "shape": [528, 342], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [342], "dtype": "float32"}, {"name": "dense_18/kernel", "shape": [342, 128], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [128, 4], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [4], "dtype": "float32"}]}]}